Catalogs/ПользователиСПравомАкцептаОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПользователиСПравомАкцептаОплат</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРассылкиЗаявкиНаУслугиИМатериалы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРассылокЗаявкиНаУслугиИМатериалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПоАвансам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПоЗаявкам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПользователиСПравомАкцептаОплат/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	ЭтотОбъект.Наименование = ЭтотОбъект.Пользователь.Наименование;
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	УжеЕсть = Справочники.ПользователиСПравомАкцептаОплат.НайтиПоРеквизиту("Пользователь",ЭтотОбъект.Пользователь);
	Если НЕ УжеЕсть.Пустая()
			И ЭтотОбъект.Ссылка <> УжеЕсть.Ссылка Тогда
		Сообщить("Такой пользователь уже есть в справочнике. Перенесите его в свою ветку при необходимости");
		Отказ = Истина;
	КонецЕсли;	
	
	Если НЕ ЭтотОбъект.ЭтоНовый() Тогда
		Если НЕ ЭтотОбъект.Активен
				И ЭтотОбъект.Ссылка.Активен Тогда
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ПользователиСПравомАкцептаОплат.Ссылка
			|ИЗ
			|	Справочник.ПользователиСПравомАкцептаОплат КАК ПользователиСПравомАкцептаОплат
			|ГДЕ
			|	ПользователиСПравомАкцептаОплат.Ссылка В ИЕРАРХИИ(&Ссылка)
			|	И ПользователиСПравомАкцептаОплат.Ссылка <> &Ссылка";
			Запрос = Новый Запрос(ТекстЗапроса);			 
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Спр = Выборка.Ссылка.ПолучитьОбъект();
				Спр.ОбменДанными.Загрузка = Истина;
				Спр.Записать();
			КонецЦикла;	
		КонецЕсли;	
		Если ЭтотОбъект.Активен
				И ЭтотОбъект.ПометкаУдаления Тогда
			ЭтотОбъект.Активен = Ложь;
		КонецЕсли;	
	КонецЕсли;	
	
	Если ЭтотОбъект.ЛимитПоАвансам<ЭтотОбъект.Ссылка.ЛимитПоАвансам И Не ЭтотОбъект.ЭтоНовый() Тогда
		Выборка = Справочники.ПользователиСПравомАкцептаОплат.Выбрать(ЭтотОбъект.Ссылка);
		Пока Выборка.Следующий() Цикл
			Если Выборка.ЛимитПоАвансам>ЭтотОбъект.ЛимитПоАвансам Тогда
				Эл = Выборка.ПолучитьОбъект();
				Эл.ЛимитПоАвансам = ЭтотОбъект.ЛимитПоАвансам;
				Эл.Записать();
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	
	//+++АК LAGP 2018.06.04 ИП-00018684 Продолжение традиции раз так надо.
	Если ЭтотОбъект.ЛимитПоЗаявкам<ЭтотОбъект.Ссылка.ЛимитПоЗаявкам И Не ЭтотОбъект.ЭтоНовый() Тогда
		Выборка = Справочники.ПользователиСПравомАкцептаОплат.Выбрать(ЭтотОбъект.Ссылка);
		Пока Выборка.Следующий() Цикл
			Если Выборка.ЛимитПоЗаявкам>ЭтотОбъект.ЛимитПоЗаявкам Тогда
				Эл = Выборка.ПолучитьОбъект();
				Эл.ЛимитПоЗаявкам = ЭтотОбъект.ЛимитПоЗаявкам;
				Эл.Записать();
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	//---АК LAGP
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.
КонецПроцедуры
